[
  {
    "id": "a11yBodyPolicyLink",
    "description": "Title for link to full accessiblity policy.",
    "defaultMessage": "Website Accessibility Policy"
  },
  {
    "id": "a11yBodyPageHeader",
    "description": "Heading for studio's accessibility policy page.",
    "defaultMessage": "Individualized Accessibility Process for Course Creators"
  },
  {
    "id": "a11yBodyIntroGraph",
    "description": "Introductory paragraph outlining why we care about accessiblity, and what we're doing about it.",
    "defaultMessage": "At edX, we seek to understand and respect the unique needs and perspectives of the edX global community.  We value every course team and are committed to being a leader in expanding access to all, including course team creators and authors with disabilities.  To that end, we have adopted a {communityAccessibilityElement} and this process to ensure that course team creators and authors with disabilities are able to develop and post content on our platform via Studio."
  },
  {
    "id": "a11yBodyStepsHeader",
    "description": "Heading for list of steps authors can take for accessiblity requests.",
    "defaultMessage": "Course team creators and authors who, because of their disabilities, need assistance to use Studio should take the following steps:"
  },
  {
    "id": "a11yBodyEdxResponse",
    "description": "Paragraph outlining how we will select an accessibility solution.",
    "defaultMessage": "We will communicate with you about your preferences and needs in determining the appropriate solution, although the ultimate decision will be ours, provided that the solution is effective and timely.  The factors we will consider in choosing an accessibility solution are: effectiveness; timeliness (relative to your deadlines); ease of implementation; and ease of use for you.  We will notify you of the decision and explain the basis for our decision within 10 business days of discussing with you."
  },
  {
    "id": "a11yBodyEdxFollowUp",
    "description": "Paragraph outlining how we will follow-up with you during and after implementing an accessibility solution.",
    "defaultMessage": "Thereafter, we will communicate with you on a weekly basis regarding our evaluation, decision, and progress in implementing the accessibility solution.  We will notify you when implementation of your accessibility solution is complete and will follow-up with you as may be necessary to see if the solution was effective."
  },
  {
    "id": "a11yBodyOngoingSupport",
    "description": "A statement of ongoing support.",
    "defaultMessage": "EdX will provide ongoing technical support as needed and will address any additional issues that arise after the initial course creation."
  },
  {
    "id": "a11yBodyProcessContact",
    "description": "Contact information heading for those with questions about the accessibility process.",
    "defaultMessage": "If you have any questions about this process, you may contact us at {emailElement} or {phoneNumber}."
  },
  {
    "id": "a11yBodyA11yFeedback",
    "description": "Contact information heading for those with accessiblity issues or suggestions.",
    "defaultMessage": "Please direct any questions or suggestions on how to improve the accessibility of Studio to {emailElement} or use the form below. We welcome your feedback."
  },
  {
    "id": "a11yBodyEmailHeading",
    "description": "Heading for list of information required when you email us.",
    "defaultMessage": "Notify us by email addressed to {emailElement}.  In order for edX to fully and promptly assess and respond to your request, please provide the following information:"
  },
  {
    "id": "a11yBodyNameEmail",
    "description": "Your contact information.",
    "defaultMessage": "Your name and email address;"
  },
  {
    "id": "a11yBodyInstitution",
    "description": "edX affiliate information.",
    "defaultMessage": "The edX member institution that you are affiliated with;"
  },
  {
    "id": "a11yBodyBarrier",
    "description": "Accessibility problem information.",
    "defaultMessage": "A brief description of the challenge or barrier to access that you are experiencing; and"
  },
  {
    "id": "a11yBodyTimeConstraints",
    "description": "Time contstraint information.",
    "defaultMessage": "How soon you need access and for how long (e.g., a planned course start date or in connection with a course-related deadline such as a final essay)."
  },
  {
    "id": "a11yBodyReceipt",
    "description": "Paragraph outlining what steps edX will take immediately.",
    "defaultMessage": "Within 48 business hours of receiving your request, the edX Support Team will respond to confirm receipt and forward your request to the edX Partner Manager for your institution and the edX Website Accessibility Coordinator."
  },
  {
    "id": "a11yBodyExtraInfo",
    "description": "Paragraph outlining how and when edX will reach out to you.",
    "defaultMessage": "With guidance from the Website Accessibility Coordinator, edX will contact you within 5 business days to discuss your request and gather additional information from you to identify a solution."
  },
  {
    "id": "a11yBodyFixesListHeader",
    "description": "Heading for list of ways we might be able to assist.",
    "defaultMessage": "EdX will assist you promptly and thoroughly so that you are able to create content on the CMS within your time constraints.  Such efforts may include, but are not limited to:"
  },
  {
    "id": "a11yBodyThirdParty",
    "description": "Buy third-party software.",
    "defaultMessage": "Purchasing a third-party tool or software for use on an individual basis to assist your use of Studio;"
  },
  {
    "id": "a11yBodyContractor",
    "description": "Hire a contractor.",
    "defaultMessage": "Engaging a trained independent contractor to provide real-time visual, verbal and physical assistance; or"
  },
  {
    "id": "a11yBodyCodeFix",
    "description": "Make a technical fix.",
    "defaultMessage": "Developing new code to implement a technical fix."
  }
]